amkamau/esp32-s3-cam-arduino-robot/Esp32s3_ov2640/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 6.0.1 Project Minimal Configuration
#
# default:
CONFIG_IDF_TARGET="esp32s3"
#
# Serial flasher config
#
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# end of Serial flasher config
#
# Partition Table
#
CONFIG_PARTITION_TABLE_CUSTOM=y
# end of Partition Table
#
# CPU frequency — run at 240 MHz for camera throughput
#
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240
#
# SPI RAM (PSRAM)
# The ESP32-S3-WROOM-1 (N16R8) on this Freenove board has 8 MB of OCTAL
# PSRAM. This is required for the camera to allocate frame buffers above
# thumbnail sizes. OCT mode reserves GPIO35-37 — do not use them as GPIO.
#
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# end of SPI RAM config
